cylinder2D_DyM/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform $turbulentOmega;

boundaryField
{
    front
    {
        type            empty;
    }
    inlet
    {
        type  fixedValue;
	value $internalField;
    }
    back
    {
        type            empty;
    }
    top
    {
        type            slip;
    }
    cylinderfront
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    bottom
    {
        type            slip;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    cylinderback
    {
        type            omegaWallFunction;
        value           $internalField;
    }
    region0_to_wallFilmRegion_wallFilmFaces
    {
        type            omegaWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
